Revit 2027 API
RebarEndType Enumeration
 Describes what is added at the end of a Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarEndType
Public Enumeration RebarEndType
public enum class RebarEndType
type RebarEndType
Members
Member name | Value | Description
Crank | 3 |  A Crank is added to the end of the Rebar.
EndTreatment | 2 |  An End Treatment is added to the end of the Rebar.
Hook | 1 |  A Hook is added to the end of the Rebar.
None | 0 |  There is nothing added to the end of the Rebar.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace